## Pandas
Learning basics of pandas from pandas website [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html).

### Import essentials:
Import **NumPy** and **Pandas**.

In [2]:
### Import numpy and pandas 
import numpy as np
import pandas as pd

### Object creation

In [6]:
# Create a series by passing the list of values 
A = pd.Series([1,2,3,4,np.nan,5,6,7])

#Display the results
A

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
6    6.0
7    7.0
dtype: float64

In [9]:
# Create a dataframe by passing NumPy array with date time indexing using data_range() and labelled column
dates = pd.date_range("20130101", periods = 6)
dates

df = pd.DataFrame(np.random.randn(6,4), index= dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.255183  1.108342  2.050925  0.161421
2013-01-02 -0.254728  0.649062  0.184206  0.579560
2013-01-03 -1.637417  2.521296 -0.171504  0.993548
2013-01-04  0.638451 -0.503608  1.382114 -0.260268
2013-01-05  0.400332  0.407160 -0.056935 -0.116763
2013-01-06  0.870945  1.431000 -1.077896 -0.510019

Create a data frame by passing a dictionary of objects that can be converted into a series-like structure.

In [11]:
df2 = pd.DataFrame({
    "A":1.0,
    "B":pd.Timestamp("20130101"),
    "C":pd.Series(1, index=list(range(4)), dtype= "float32"),
    "D":np.array([3] *4, dtype= "int32"),
    "E":pd.Categorical(["test", "train", "test", "train"]),
    "F":"foo"
})

df2

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  foo
1  1.0 2013-01-01  1.0  3  train  foo
2  1.0 2013-01-01  1.0  3   test  foo
3  1.0 2013-01-01  1.0  3  train  foo

Know the different datatypes in the data frame

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Viewing data

In [13]:
df.head() #for the top rows

                   A         B         C         D
2013-01-01  0.255183  1.108342  2.050925  0.161421
2013-01-02 -0.254728  0.649062  0.184206  0.579560
2013-01-03 -1.637417  2.521296 -0.171504  0.993548
2013-01-04  0.638451 -0.503608  1.382114 -0.260268
2013-01-05  0.400332  0.407160 -0.056935 -0.116763

In [14]:
df.tail(3) #bottom 3 rows

                   A         B         C         D
2013-01-04  0.638451 -0.503608  1.382114 -0.260268
2013-01-05  0.400332  0.407160 -0.056935 -0.116763
2013-01-06  0.870945  1.431000 -1.077896 -0.510019